Repository: codernr/Fishbowl.NET
Catalog: Client.Shared/I18n/Resources.*.resx
Languages: hu

# Common.GameName
source: Fishbowl game
hu: Japán activity

# Common.Abort.InvalidReturnValue
source: Invalid word has been revoked, game is aborted.
hu: Érvénytelen szó lett visszahívva, a játék leállt.

# Common.Abort.PlayerCount
source: The number of players is less than number of teams twice.
hu: A játékosok száma kevesebb, mint a csapatok számának kétszerese. A játék leállt.

# Common.Abort.Timeout
source: You have been idle for too much time, game has been shut down.
hu: Túl sokáig nem játszottatok, a játék leállt.

# Common.Error.Required
source: Required field
hu: Kötelező mező

# Common.GameCreated
source: Game created! Now your friends can join the game with the password you set.
hu: Játék létrehozva! Most már csatlakozhatnak a többiek a megadott jelszóval!

# Common.Fullscreen.Title
source: Fullscreen is not available
hu: A teljes képernyő nem elérhető

# Common.Fullscreen.Message
source: If you're using iOS, you can add the app to your home screen by going to share menu to play the game in full screen.
hu: Ha iOS-t használsz, hozzáadhatod az appot a home screenedhez a megosztás menüből, hogy teljes képernyős módban játszhass!

# Components.TeamMembers.Title
source: Your team
hu: Csapatod

# Components.States.Common.PlayerName
source: Name
hu: Név

# Components.States.Common.PlayerName.ErrorMessage
source: Lowercase, dash, dot and numbers between 3 and 32 characters
hu: 3 és 32 közötti hosszúság, csak angol kisbetűk, kötőjel, pont és számok

# Components.States.Common.PlayerWords.Word.0
source: First word
hu: Első szó

# Components.States.Common.PlayerWords.Word.1
source: Second word
hu: Második szó

# Components.States.Common.PlayerWords.Word.2
source: Third word
hu: Harmadik szó

# Components.States.Common.PlayerWords.Word.3
source: Fourth word
hu: Negyedik szó

# Components.States.Common.PlayerWords.MinLengthError
source: At least two characters long
hu: Minimum két karakter

# Components.States.Common.PlayerCount
source: Connected players: {1}/{0} | Players ready: {2}/{0}
hu: Kapcsolódva: {1}/{0} | Beállítva: {2}/{0}

# Components.States.GameSetup.Title
source: Setup game
hu: Játék beállítása

# Components.States.GameSetup.Info
source: Others can join the game with given password after setup.
hu: A beállítás után csatlakozhatnak a többiek a megadott jelszóval.

# Components.States.GameSetup.PlayerCount
source: Number of players
hu: Játékosok száma

# Components.States.GameSetup.TeamCount
source: Number of teams
hu: Csapatok száma

# Components.States.GameSetup.WordCount
source: Number of words per player
hu: Szavak száma játékosonként

# Components.States.GameSetup.RoundTypes
source: Rounds
hu: Szakaszok

# Components.States.GameSetup.RoundTypes.Taboo
source: Taboo
hu: Körülírás

# Components.States.GameSetup.RoundTypes.Drawing
source: Drawing
hu: Rajzolás

# Components.States.GameSetup.RoundTypes.Charades
source: Charades
hu: Mutogatás

# Components.States.GameSetup.RoundTypes.Password
source: Password
hu: Egy szó

# Components.States.GameSetup.RoundTypes.Humming
source: Humming
hu: Hümmögés

# Components.States.GameSetup.SubmitButton
source: Submit
hu: Beállít

# Components.States.ConnectionClosed.Title
source: Connection closed
hu: Megszűnt a kapcsolat

# Components.States.ConnectionClosed.Description
source: Reload the page to reconnect
hu: Töltsd újra az oldalt az újracsatlakozáshoz!

# Components.States.ConnectionClosed.Button
source: Reconnect
hu: Újracsatlakozás

# Components.States.GameFinished.Title
source: Results
hu: Eredmények

# Components.States.GameFinished.Winner
source: Winner team:
hu: Nyertes csapat:

# Components.States.GameFinished.BestPlayer
source: Best player:
hu: Legjobb játékos:

# Components.States.GameFinished.EasiestWord
source: Easiest word:
hu: Legkönnyebb szó:

# Components.States.GameFinished.HardestWord
source: Hardest word:
hu: Legnehezebb szó:

# Components.States.GameFinished.Scores
source: scores:
hu: pont:

# Components.States.GameFinished.TotalTime
source: time:
hu: idő:

# Components.States.GameFinished.Button
source: New game
hu: Új játék

# Components.States.UsernamePassword.Title
source: Set username and password
hu: Add meg a neved és a jelszót

# Components.States.UsernamePassword.Password
source: Password
hu: Jelszó

# Components.States.UsernamePassword.Password.ErrorMessage
source: Lowercase, dash, dot and numbers between 3 and 32 characters
hu: 3 és 32 közötti hosszúság, csak angol kisbetűk, kötőjel, pont és számok

# Components.States.UsernamePassword.CreateButton
source: Create
hu: Új játék

# Components.States.UsernamePassword.JoinButton
source: Join
hu: Csatlakozás

# Components.States.PeriodFinished.Title
source: Period finished
hu: Kör vége

# Components.States.PeriodFinished.Scores
source: scores
hu: pontjai

# Components.States.PeriodFinished.GuessedWords
source: Guessed words
hu: Kitalált szavak

# Components.States.PeriodPlay.GuessedButton
source: Guessed
hu: Kitaláltuk!

# Components.States.PeriodPlay.PassButton
source: Pass
hu: Passz

# Components.States.PeriodPlay.RevokeButton
source: Revoke
hu: Visszavonás

# Components.States.PeriodPlay.InfoAlert
source: You can try on with the last word if others don't accept your last guess.
hu: Ha a többiek nem fogadják el az utolsó találatot, a visszavonás gombbal tovább próbálkozhattok.

# Components.States.PeriodPlay.WarningAlert
source: Your team has one guess, press Pass button if missed.
hu: Most már csak egyet tippelhet a csapat, ha nem talált, nyomd meg a passz gombot!

# Components.States.PeriodSetupPlay.PeriodLength
source: Period length
hu: Kör hossza

# Components.States.PeriodSetupPlay.StartButton
source: Start
hu: Indítás

# Components.States.PeriodSetupWatch.NextPlayer
source: Next player
hu: Következő játékos

# Components.States.PeriodSetupWatch.PeriodLength
source: Period length
hu: Kör hossza

# Components.States.PeriodWatch.Playing
source: Playing
hu: Aktuális játékos

# Components.States.PlayerSetup.Title
source: Set player #{0} name and words
hu: {0}. játékos neve és szavai

# Components.States.PlayerSetup.SubmitButton
source: Set
hu: Beállít

# Components.States.PlayerWords.Title
source: Set player words
hu: Add meg a szavaidat

# Components.States.PlayerWords.SubmitButton
source: Set
hu: Beállít

# Components.States.Restore.Title
source: Restore saved game?
hu: Folytatod a játékot?

# Components.States.Restore.RestoreButton
source: Restore saved game
hu: Mentett játék folytatása

# Components.States.Restore.NewGameButton
source: Start new game
hu: Új játék

# Components.States.RoundFinished.Title
source: Round finished
hu: Szakasz vége

# Components.States.RoundFinished.Scores
source: Scores
hu: Pontok

# Components.States.TeamName.Title.Online
source: Name your team
hu: Nevezd el a csapatod

# Components.States.TeamName.Title.Pwa
source: Name team #{0}
hu: {0}. csapat elnevezése

# Components.States.TeamName.Label
source: Name
hu: Név

# Components.States.TeamName.Button
source: Set
hu: Beállít

# Components.States.TeamName.MinLengthError
source: At least 3 characters long
hu: Minimum 3 karakter

# Components.States.WaitingForPlayers.Title
source: Waiting...
hu: Várakozás...

# Components.States.WaitingForPlayers.Message
source: Other players are still working...
hu: A többiek még pötyögnek...

# Components.States.WaitingForTeamNames.Title
source: Team name setup
hu: Csapatnevek megadása

# Components.States.WaitingForTeamNames.SetupPlayer
source: The player who sets team name: {0}
hu: A csapat nevét ő állítja be: {0}

# Components.States.WaitingForTeamNames.TeamNames
source: Team names
hu: Csapatnevek

# Pages.Play.Reconnecting
source: Connection lost, reconnecting...
hu: Megszakadt a kapcsolat, újracsatlakozás...

# Pages.Play.Scored
source: Score
hu: Pontszerzés

# Pages.Play.ScoreRevoked
source: Score revoked
hu: Visszavont pont

# Pages.Play.SetupCount
source: Setup player no. {0}
hu: {0}. játékos beállítása

# Pages.Play.ErrorTitle
source: Error!
hu: Hiba!

# Pages.Play.StatusCode.ConnectionAlreadyAssigned
source: Connection error. Try reloading the page.
hu: Kapcsolódási hiba, frissítsd az oldalt!

# Pages.Play.StatusCode.GameContextExists
source: The password can't be used to create the game. Try another one.
hu: Ezzel a jelszóval nem tudsz játékot létrehozni. Próbálj meg egy másikat!

# Pages.Play.StatusCode.GameContextNotFound
source: No game found with the given password.
hu: Nem található játék a megadott jelszóval.

# Pages.Play.StatusCode.GameContextFull
source: This game is already full.
hu: A megadott jelszóhoz tartozó játék már tele van.

# Pages.Play.StatusCode.ConcurrencyError
source: Something went wrong. Try reloading the page.
hu: Váratlan hiba történt! Próbáld meg újratölteni a lapot!

# Pages.Play.StatusCode.UsernameTaken
source: The selected username is taken.
hu: A felhasználónév foglalt.

# Pages.Play.GameStartedTitle
source: Starting the game
hu: Kezdődik a játék

# Pages.Play.RoundStartedTitle
source: Start round
hu: Új szakasz
